backend/app/controllers/arts_controller.rb

    def index
        render json: Art.all
---
SELECT "arts".* FROM "arts"

    def show
        render json: Art.find(params[:id])
---
SELECT "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        render json: Art.create(params_new)
---
INSERT INTO "arts" ("title", "medium", "description", "image", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
        render json: Art.destroy(params[:id])
---
DELETE FROM "arts" WHERE "arts"."id" = ?  [["id", 10]]

    def artmaker
        render json: Art.find(params[:id]).user
---
SELECT "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]