backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "password", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test 123112412"], ["username", "username"], ["password", "[FILTERED]"], ["bio", "bio"], ["created_at", "2022-11-02 13:46:32.882365"], ["updated_at", "2022-11-02 13:46:32.882365"]]
---
    def create
        render json: User.create(params_new)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]
---
    def destroy
        render json: User.destroy(params[:id])

SELECT "arts".* FROM "arts" WHERE "arts"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def arts
        render json: User.find(params[:id]).arts